[
  {
    "id": "hapuku-tree-suites",
    "title": "Hapuku Carob Tree Suites",
    "location": "Kaikoura, Canterbury",
    "type": "Treehouse",
    "price": "$850",
    "rating": 4.9,
    "description": "Perched thirty feet above the ground in the canopy of a native Manuka grove, the Hapuku Tree Suites offer a truly elevated escape. With large glass windows opening onto the Kaikoura mountains and the Pacific Ocean, this accommodation seamlessly blends luxury with the raw beauty of the landscape. The scent of wild thyme and the sound of crashing waves create a sensory experience unlike any other.\n\nInside, you'll find a deep soaking tub, a fireplace for cooler evenings, and custom-crafted furniture that echoes the natural surroundings. It is the perfect romantic hideaway for couples seeking intimacy and connection with nature, all while enjoying five-star service and gourmet dining just a short walk away.",
    "amenities": ["Ocean View", "Soaking Tub", "Fireplace", "Breakfast Included", "Wifi"],
    "image": "https://images.unsplash.com/photo-1520250497591-112f2f40a3f4?auto=format&fit=crop&w=800&q=80",
    "affiliateLink": "#"
  },
  {
    "id": "glass-house-banks",
    "title": "The Glass PurePod",
    "location": "Banks Peninsula, Canterbury",
    "type": "Glass Pod",
    "price": "$590",
    "rating": 4.8,
    "description": "Immerse yourself completely in the stunning vistas of Banks Peninsula with a stay in this architectural marvel made entirely of heavy-duty glass. From the floor to the ceiling, there are no secrets between you and the stars. Watch the sunrise paint the tussock hills in gold from the comfort of your plush queen bed, or observe the Milky Way drift overhead in total silence.\n\nThis off-grid experience is designed to help you disconnect from the digital world and reconnect with the rhythms of the earth. Complete with a telescope, bio-fuel heater, and a luxurious shower with a glass floor revealing the ferns beneath, it is a masterclass in minimal impact and maximum immersion.",
    "amenities": ["Stargazing", "Off-grid", "Telescope", "BBQ", "Privacy"],
    "image": "https://images.unsplash.com/photo-1449156493391-d2cfa28e468b?auto=format&fit=crop&w=800&q=80",
    "affiliateLink": "#"
  },
  {
    "id": "raglan-yurt-retreat",
    "title": "Nikau Yurt Retreat",
    "location": "Raglan, Waikato",
    "type": "Yurt",
    "price": "$280",
    "rating": 4.7,
    "description": "Hidden within a lush sub-tropical forest, the Nikau Yurt is a bohemian sanctuary located just minutes from the world-famous surf breaks of Raglan. Hand-crafted from local timber and canvas, the circular space promotes a sense of calm and flow. The interior is adorned with Moroccan rugs, vintage velvet armchairs, and a wood-burning stove that keeps the space toasty warm year-round.\n\nOutside, a private cedar hot tub awaits under the canopy of giant tree ferns. Listen to the call of the Tui birds as you soak in the steaming water, or practice yoga on the wraparound deck. This is an idyllic spot for free spirits looking to slow down and embrace the laid-back West Coast vibe.",
    "amenities": ["Hot Tub", "Wood Stove", "Kitchenette", "Yoga Deck", "Forest View"],
    "image": "https://images.unsplash.com/photo-1534119468153-6a9787e79307?auto=format&fit=crop&w=800&q=80",
    "affiliateLink": "#"
  },
  {
    "id": "wanaka-tiny-house",
    "title": "Alpine Tiny Oasis",
    "location": "Wanaka, Otago",
    "type": "Tiny House",
    "price": "$320",
    "rating": 4.9,
    "description": "Small in footprint but massive in character, this architectural tiny home sits in an open paddock with uninterrupted 360-degree views of the Southern Alps. Designed with Scandinavian minimalism in mind, every inch of space is utilized to create a cozy, light-filled haven. The loft bedroom features a skylight perfectly positioned for stargazing, while the living area opens fully to the outdoors.\n\nSpend your days hiking the nearby Roys Peak track and your evenings sipping local Pinot Noir by the outdoor fire pit. Despite its size, the oasis comes fully equipped with a modern kitchen and a rain shower, proving that luxury isn't about how much space you have, but how you use it.",
    "amenities": ["Mountain View", "Skylight", "Fire Pit", "Wifi", "Kitchen"],
    "image": "https://images.unsplash.com/photo-1518780664697-55e3ad937233?auto=format&fit=crop&w=800&q=80",
    "affiliateLink": "#"
  },
  {
    "id": "taupo-geo-dome",
    "title": "Lakeview Geodesic Dome",
    "location": "Taupo, Waikato",
    "type": "Geodesic Dome",
    "price": "$410",
    "rating": 4.6,
    "description": "Futuristic design meets rugged wilderness in this stunning geodesic dome overlooking the glistening waters of Lake Taupo. The geometric structure offers a spacious, airy interior with panoramic windows that flood the room with natural light. Furnished with contemporary decor and a king-sized bed, it provides a glamorous camping experience without sacrificing comfort.\n\nThe large deck features a sunken bath, perfect for relaxing after a day of exploring the nearby geothermal wonders or mountain biking. As night falls, the dome glows like a lantern in the bush, offering a cozy retreat where you can feel secure while remaining intimately connected to the elements.",
    "amenities": ["Lake View", "Outdoor Bath", "King Bed", "BBQ", "Heating"],
    "image": "https://images.unsplash.com/photo-1523987355523-c7b5b0dd90a7?auto=format&fit=crop&w=800&q=80",
    "affiliateLink": "#"
  },
  {
    "id": "coromandel-earthship",
    "title": "Sustainable Earthship",
    "location": "Coromandel Town, Coromandel",
    "type": "Eco-Home",
    "price": "$350",
    "rating": 4.8,
    "description": "Experience sustainable living at its finest in this quirky and colorful Earthship, built entirely from recycled materials and rammed earth. Nestled into the hillside, the home maintains a constant comfortable temperature naturally. The front face is a greenhouse of edible plants, filling the living space with the scent of jasmine and herbs.\n\nThis stay is as educational as it is relaxing, offering a glimpse into a lifestyle that treads lightly on the planet. Unique features include a bottle-brick wall that casts kaleidoscope light into the bathroom and a rooftop garden with sweeping views of the Hauraki Gulf. Perfect for eco-conscious travelers seeking inspiration.",
    "amenities": ["Eco-friendly", "Ocean View", "Garden", "Full Kitchen", "Solar Power"],
    "image": "https://images.unsplash.com/photo-1510798831971-661eb04b3739?auto=format&fit=crop&w=800&q=80",
    "affiliateLink": "#"
  },
  {
    "id": "castle-hill-a-frame",
    "title": "High Country A-Frame",
    "location": "Castle Hill, Canterbury",
    "type": "Cabin",
    "price": "$290",
    "rating": 4.7,
    "description": "Located amidst the limestone boulder fields of Castle Hill, this classic A-frame cabin is a photographer's dream. The steep roofline mimics the surrounding peaks, while the timber interior exudes a rustic, alpine charm. It serves as the ultimate basecamp for bouldering, skiing, or simply exploring the dramatic landscapes of the Arthur's Pass region.\n\nThe cabin is off-grid but comfortable, utilizing solar power and a roaring log burner to keep the chill at bay. Evenings here are spent playing board games by candlelight or stepping outside to witness one of the darkest majestic night skies in the world.",
    "amenities": ["Fireplace", "Board Games", "Mountain View", "Solar Power", "Hiking"],
    "image": "https://images.unsplash.com/photo-1449156493391-d2cfa28e468b?auto=format&fit=crop&w=800&q=80",
    "affiliateLink": "#"
  },
  {
    "id": "abel-tasman-safari",
    "title": "Golden Bay Safari Tent",
    "location": "Abel Tasman, Nelson",
    "type": "Glamping",
    "price": "$450",
    "rating": 4.9,
    "description": "Channel the spirit of an African safari while overlooking the golden sands of New Zealand’s north-western coast. This luxury canvas tent is set on a raised timber platform, ensuring premium views of the turquoise Tasman Bay. Inside, you’ll find hardwood floors, a four-poster bed, and antique furnishings that transport you to a bygone era of exploration.\n\nThe highlight is the en-suite open-air bathroom, where you can shower under the ferns. With direct access to private walking trails and a secluded beach, this glamping experience offers the perfect blend of adventure and indulgence in one of the country's sunniest regions.",
    "amenities": ["Beach Access", "En-suite", "Breakfast", "Kayak Hire", "Privacy"],
    "image": "https://images.unsplash.com/photo-1478131143081-80f7f84ca84d?auto=format&fit=crop&w=800&q=80",
    "affiliateLink": "#"
  },
  {
    "id": "waiheke-container",
    "title": "The Box on the Hill",
    "location": "Waiheke Island, Auckland",
    "type": "Container Home",
    "price": "$380",
    "rating": 4.6,
    "description": "Industrial chic meets island paradise in this converted shipping container home perched high above Onetangi Beach. The black steel exterior contrasts strikingly with the warm plywood interior and floor-to-ceiling glass sliders. The design is ingenious, transforming a compact industrial object into a spacious, light-filled retreat.\n\nRelax on the expansive deck with a glass of Waiheke’s finest Syrah as the sun sets over the vineyard-covered hills. The container includes a designer kitchenette and a luxurious bathroom, making it a stylish and self-contained getaway just a ferry ride from Auckland city.",
    "amenities": ["Ocean View", "Vineyard Access", "Wifi", "AC", "Deck"],
    "image": "https://images.unsplash.com/photo-1533658299645-1c88820c754d?auto=format&fit=crop&w=800&q=80",
    "affiliateLink": "#"
  },
  {
    "id": "matamata-underground",
    "title": "The Burrow",
    "location": "Matamata, Waikato",
    "type": "Earth Home",
    "price": "$600",
    "rating": 4.9,
    "description": "Live out your fantasy adventures in this enchanting underground dwelling carved into the rolling green hills of the Waikato. With its round door, grass roof, and circular windows, The Burrow feels like it has been lifted straight from a storybook. The interior is cozy and cavernous, featuring exposed timber beams and handcrafted stone fireplaces.\n\nDespite its rustic appearance, the home is warm and dry, offering modern amenities cleverly disguised to fit the theme. It’s a magical escape for families or fans of Middle-earth, located just a stone's throw from the official movie set tours.",
    "amenities": ["Themed Decor", "Fireplace", "Garden", "Breakfast", "Wifi"],
    "image": "https://images.unsplash.com/photo-1510798831971-661eb04b3739?auto=format&fit=crop&w=800&q=80",
    "affiliateLink": "#"
  }
]